echo "*******************************************************************************"
echo " 禁用firewalld防火墙，安装启用iptable"
echo "*******************************************************************************"

echo "*******************************************************************************"
echo " 关闭firewalld防火墙并禁止开机启动firewalld"
echo "*******************************************************************************"
systemctl  stop   firewalld.service
systemctl   disable   firewalld.service
echo "*******************************************************************************"
echo " 关闭firewalld防火墙并禁止开机启动firewalld成功"
echo " 查看firewalld防火墙状态命令是：firewall-cmd    --state"
echo "*******************************************************************************"

echo "*******************************************************************************"
echo " 安装启用iptable"
echo "*******************************************************************************"
yum install  iptables-services
systemctl  start  iptables.service
systemctl  restart  iptables.service
echo "*******************************************************************************"
echo " 安装启用iptable成功"
echo " 查看iptables防火墙状态的命令是：systemctl  status  iptables.service"
echo "*******************************************************************************"